{
  "recycling": {
    "14": [
      "How has the recycling practice changed over the years? Did the recycling materials change compared to the past? Tell me all the changes regarding the recycling system in your country."
    ],
    "15": [
      "Please tell me about some recent issues related to recycling in your country. What was the news about? What does the media say about this problem? What do you think about this matter? How does this matter affect the environment?"
    ]
  },


  "internet": {
    "14": [
      "How is the way of using the internet different in different age groups? What does the younger group typically do on the internet, and how do the older people use the internet? Please discuss how they use the internet differently."
    ],
    "15": [
      "Tell me some issues regarding the internet these days. For example, security problems, personal information, or related to society. How have these concerns changed over the years, and how do they affect people in your country?"
    ]
  },
 


  "movie": {
    "14": [
      "Please compare the movies today to the movies you watched when you were young. What are the differences and the similarities? Tell me how movies have changed over the years."
    ],
    "15": [
      "What issues regarding movies do you usually discuss with your friends or family these days? Is there some news with actors or actresses recently? How did the news affect people’s impressions? And what are the recent trends in the movie industry? Tell me everything in detail."
    ]
  },


  "gathering": {
    "14": [
      "People have gatherings and celebrations for particular reasons. How were gatherings and celebrations when you were a child? How were they different from now? How do people get together nowadays? Tell me how gatherings have changed over the years."
    ],
    "15": [
      "Sometimes people can complain about the gatherings and celebrations. What concerns do people in your community have about gatherings and celebrations? Perhaps, they complain about traffic or noise. What do people complain about such gatherings?"
    ]
  },


  "park": {
    "14": [
      "Compare the activities that children do at parks with adults do at parks. What are the differences between them? How about the facilities at parks for children and adults?"
    ],
    "15": [
      "Talk about some problems with parks in your country these days. What are the challenges parks face, and what is the biggest problem? What things do people need to do to solve the issues?"
    ]
  },


  "family, freinds": {
    "14": [
      "Please pick two of different your friends or family members. What are the differences and similarities between them? Describe each of them in detail."
    ],
    "15": [
      "When you are with your friends or family members, what do you typically talk about with them? What topic do you talk about most often? How was the last conversation you had with them? Tell me about the normal conversation in detail."
    ]
  },


  "music": {
    "14": [
      "Please pick two different kinds of music or musician you like. Compare those two, and what are their differences and similarities? Give as many details as you can."
    ],
    "15": [
      "I’d like to know what gadgets or electronic equipment people are interested in these days? Why do people in your country like those musical gadgets or equipment? What new products excite them, and why? Tell me what these people talk about it."
    ]
  },


  "health": {
    "14": [
      "How was the way people in your country maintained their health when you were young, and how is it now? Tell me how people keep their health has changed over the years."
    ],
    "15": [
      "People have different views on what is healthy. How does your parents’ generation define health? And what do your age group think about being healthy? Tell me how different people think about health."
    ]
  },


  "bars": {
    "14": [
      "What do people usually do at bars? How have the activities people do at bars changed over the years? What are things different from bars 5 or 10 years ago? Compare the differences and the similarities between the bars in the past and the bars today."
    ],
    "15": [
      "Have you heard the news or a media report about bars or pubs where the police are involved? What happened? How did it turn out in the end? What do people say about this? Tell me everything in detail."
    ]
  },


  "industry": {
    "14": [
      "I’d like to know about the rising industries in your country. What industries do people talk about these days? What is this industry about? How has that industry changed over the years? How was it different compared to the industry now?"
    ],
    "15": [
      "Have the industry you just mentioned ever released a new product that couldn’t meet people’s expectations? What was the product about? Why were people disappointed about it? How did people react to this issue?"
    ]
  }

 
}
